[
    {
      "title": "Cisco Confirms Authenticity of Data After Second Leak",
      "category": "Data Breach",
      "author": "Eduard Kovacs",
      "date": "December 30, 2024",
      "image": "../assets/img/blog/Cisco-cybersecurity-business.jpg",
      "link": "https://www.securityweek.com/cisco-confirms-authenticity-of-data-after-second-leak/",
      "content": "A hacker has leaked more data stolen from a Cisco DevHub instance and the tech giant has confirmed its authenticity and that it originated from a recently disclosed security incident. The hacker known as IntelBroker announced on October 14 that he and others had breached Cisco systems and obtained source code, certificates, credentials, confidential documents, encryption keys and other types of information. Cisco’s investigation showed that its systems had not been breached and that the data was actually taken from a public-facing DevHub environment that served as a resource center providing source code, scripts and other content to customers. While much of the data from this DevHub instance is already public, some of the files obtained by the hackers were not supposed to be public, Cisco admitted. IntelBroker later confirmed that the data was obtained from a DevHub instance and started leaking files. The hacker initially claimed to have obtained 800 Gb of files, but later said 4.5 Tb of data was taken from the DevHub environment. In mid-December he made available roughly 3 Gb of the data and on Christmas Day he leaked another batch of files, totaling more than 4 Gb. The leaked data includes source code, scripts, digital certificates, and configuration files pertaining to Cisco products. Cisco said following the second leak that it analyzed the data and found that it aligns with the known data set from October 14, 2024. As noted in prior updates, we are confident that there has been no breach of our systems, and we have not identified any information in the content that an actor could have used to access any of our production or enterprise environments, the company explained. Cisco initially said it had no evidence that sensitive personal information or financial data was compromised, but it has since removed this statement from its incident reports."
    },
    {
      "title": "Nokia Says Impact of Recent Data Leak Is Limited",
      "category": "Data Breach",
      "author": "Eduard Kovacs",
      "date": "November 7, 2024",
      "image": "../assets/img/blog/nokia.webp",
      "link": "./blog-details.html",
      "content": "Nokia says the impact of the recent data leak is very limited, and there is no indication that the cybersecurity incident could have a significant impact on the company or its customers. On November 4, the notorious hacker known as IntelBroker announced the sale of a 'large collection of Nokia source code,' which he claimed to have obtained from a third-party contractor 'that directly worked with Nokia to help their development of some internal tools.' The hacker claimed to have stolen source code, SSH and RSA keys, Bitbucket logins, SMTP accounts, and other credentials. The tech giant’s initial statement said it had found no evidence of its systems or data being impacted. On November 7, IntelBroker said he was unhappy with Nokia’s response and decided to make the stolen data available on a popular hacking forum. 'In this breach you will find a lot of Nokia related source code, which they lend out to their customers, as you’ll see mentions of popular ISP and internet providers mentioned,' the hacker said. In response, Nokia said its investigation found no evidence that any of its systems or data were impacted. 'This was a 3rd party security incident, related to a single customized software application, being used on a single customer network,' a Nokia spokesperson told SecurityWeek. 'This software was not developed by Nokia and cannot be used to negatively impact Nokia or its customers. We continue to closely monitor the situation,' the spokesperson added. While several major companies have confirmed being hacked by IntelBroker in recent years, the hacker has also been known to make exaggerated claims."
    }
    
  ]
  